## Conceitos e criação de DataFrame I

In [1]:
import pandas as pd

In [5]:
#DataFrame criado a partir de um Dicionario de lista
dados ={
    'empresa': ['Revista Exame', 'Let\'s Code', 'Google', 'Nasa'],
    'n_funcionarios': [30, 20, 40, 25],
    'capital': [10000, 20000, 7000, 12000]
}

In [6]:
df = pd.DataFrame(dados)
df

         empresa  n_funcionarios  capital
0  Revista Exame              30    10000
1     Let's Code              20    20000
2         Google              40     7000
3           Nasa              25    12000

In [17]:
#DataFrame criado a partir de Lista de Dicionarios
dados = [
    {
    'empresa': ['Let\'s Code'],
    'n_funcionarios': [30],
    'capital': [10000]
    },
    {
    'empresa': ['Exame'],
    'n_funcionarios': [20],
    'capital': [20000]    
    }
]

In [10]:
df = pd.DataFrame(dados)
df

        empresa n_funcionarios  capital
0  [Let's Code]           [30]  [10000]
1       [Exame]           [20]  [20000]

In [14]:
#DataFrame criado a partir de Tuplas
dados = [
    ('Let\'s Code', 20, 10000),
    ('Revista Exame', 25, 20000)
]

df = pd.DataFrame(dados, columns = ['empresa', 'n_funcionarios', 'capital'])
df

         empresa  n_funcionarios  capital
0     Let's Code              20    10000
1  Revista Exame              25    20000

## Conceitos e criação de DataFrame II

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   empresa         2 non-null      object
 1   n_funcionarios  2 non-null      int64
 2   capital         2 non-null      int64
dtypes: int64(2), object(1)
memory usage: 176.0+ bytes

In [16]:
df.describe()

       n_funcionarios       capital
count        2.000000      2.000000
mean        22.500000  15000.000000
std          3.535534   7071.067812
min         20.000000  10000.000000
25%         21.250000  12500.000000
50%         22.500000  15000.000000
75%         23.750000  17500.000000
max         25.000000  20000.000000

## ------------------------------------------------EXERCICIOS---------------------------------------------------------------

##### 1. Uma loja de produtos eletrônicos possui um aplicativo por meio do qual ela vende os seus produtos. Essa empresa decidiu analisar o tempo médio que os seus clientes passam no app e relacionar com o dinheiro que esses clientes gastam na compra de produtos. A tabela abaixo apresenta esses dados apenas para cinco clientes:

|Cliente | Tempo no app | Dinheiro gasto
|--------|--------------|--------------
|Davi    | 12.65        |  R$ 529.04
|Rebecca | 11.10        |  R$ 392.20
|Luiz    | 17.55        | R$  599.40
|Ana     | 15.89        | R$ 587.95
|Wilson  | 13.56        | R$ 487.54
 

#### Com base nesses dados, crie um DataFrame utilizando um dicionário de listas.

In [1]:
import pandas as pd

dados = {
    'Cliente': ['Davi', 'Rebecca', 'Luiz', 'Ana', 'Wilson'],
    'Tempo no app': [12.65, 11.10, 17.55, 15.89, 13.56],
    'Dinheiro gasto': [529.04, 392.20, 599.40, 587.95, 487.54]
}

In [2]:
df = pd.DataFrame(dados)
df

   Cliente  Tempo no app  Dinheiro gasto
0     Davi         12.65          529.04
1  Rebecca         11.10          392.20
2     Luiz         17.55          599.40
3      Ana         15.89          587.95
4   Wilson         13.56          487.54

#### 2. Com base nos mesmos dados da questão 1, crie um DataFrame utilizando um lista de dicionários.

In [3]:
dados = [
    {
    'Cliente': ['Davi'],
    'Tempo no app': [12.65],
    'Dinheiro gasto': [529.04]
    },
    {
    'Cliente': ['Rebecca'],
    'Tempo no app': [11.10],
    'Dinheiro gasto': [392.20] 
    },
    {
    'Cliente': ['Luiz'],
    'Tempo no app': [17.55],
    'Dinheiro gasto': [599,40] 
    },
    {
    'Cliente': ['Ana'],
    'Tempo no app': [15.89],
    'Dinheiro gasto': [587,95] 
    },
    {
    'Cliente': ['Wilson'],
    'Tempo no app': [13.56],
    'Dinheiro gasto': [487.54] 
    }
]

In [4]:
df = pd.DataFrame(dados)
df

     Cliente Tempo no app Dinheiro gasto
0     [Davi]      [12.65]       [529.04]
1  [Rebecca]       [11.1]        [392.2]
2     [Luiz]      [17.55]      [599, 40]
3      [Ana]      [15.89]      [587, 95]
4   [Wilson]      [13.56]       [487.54]

##### 3. Com base nos mesmos dados da questão 1, crie um DataFrame utilizando um lista de tuplas. Não esqueça de atribuir nomes às colunas.

In [5]:
dados = [
    ('Davi', 12.65, 529.04),
    ('Rebecca', 11.10, 392.20),
    ('Luiz', 17.55, 599.40),
    ('Ana', 15.89, 587.95),
    ('Wilson', 13.56, 487.54),
]

df = pd.DataFrame(dados, columns = ['Cliente', 'Tempo no app', 'Dinheiro gasto'])
df

   Cliente  Tempo no app  Dinheiro gasto
0     Davi         12.65          529.04
1  Rebecca         11.10          392.20
2     Luiz         17.55          599.40
3      Ana         15.89          587.95
4   Wilson         13.56          487.54

#### ##### 4. Escolha um dos métodos utilizados nas questões anteriores para criar um DataFrame com base nos valores da tabela abaixo. Observe que essa tabela contém 10 empresas (de A a J), o número de funcionários de cada uma delas e o seu porte com base no número de funcionários.

Empresa | Número de Funcionários | Porte da Empresa
:-------|:-----------------------|:----------------
A | 141 | Médio
B | 640 | Grande
C | 131 | Médio
D | 582 | Grande
E | 475 | Médio
F | 511 | Grande
G | 641 | Grande
H | 58  | Pequeno
I | 690 | Grande
J | 23  | Pequeno

#### Em seguida, utilize os métodos info, describe, head e tail para visualizar os dados do DataFrame.

In [6]:
dados = {
    'Empresa': ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J',],
    'Número de Funcionários': [141, 640, 131, 582, 475, 511, 641, 58, 690, 23],
    'Porte da Empresa': ['Médio', 'Grande', 'Médio', 'Grande', 'Médio', 'Médio', 'Médio', 'Pequeno', 'Grande', 'Pequeno']
}

df = pd.DataFrame(dados)
df

  Empresa  Número de Funcionários Porte da Empresa
0       A                     141            Médio
1       B                     640           Grande
2       C                     131            Médio
3       D                     582           Grande
4       E                     475            Médio
5       F                     511            Médio
6       G                     641            Médio
7       H                      58          Pequeno
8       I                     690           Grande
9       J                      23          Pequeno

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Empresa                 10 non-null     object
 1   Número de Funcionários  10 non-null     int64
 2   Porte da Empresa        10 non-null     object
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes

In [8]:
df.describe()

       Número de Funcionários
count                10.00000
mean                389.20000
std                 268.37362
min                  23.00000
25%                 133.50000
50%                 493.00000
75%                 625.50000
max                 690.00000

In [9]:
df.head()

  Empresa  Número de Funcionários Porte da Empresa
0       A                     141            Médio
1       B                     640           Grande
2       C                     131            Médio
3       D                     582           Grande
4       E                     475            Médio

In [10]:
df.tail()

  Empresa  Número de Funcionários Porte da Empresa
5       F                     511            Médio
6       G                     641            Médio
7       H                      58          Pequeno
8       I                     690           Grande
9       J                      23          Pequeno

## Feedback - Questão 4
dados = {
    
    'Empresa': 'A B C D E F G H I J'.split(), 
    
    'Nº de Funcionários': [141, 640, 131, 582, 475, 511, 641, 58, 690, 23], 
    
    'Porte da Empresa': ['Médio', 'Grande', 'Médio', 'Grande', 'Médio', 'Grande', 'Grande', 'Pequeno', 'Grande', 'Pequeno']
}

df = pd.DataFrame(dados)

df.info()
df.describe()
df.head()
df.tail()